MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K42/mcu.h
extern volatile PIE10bits_t PIE10bits __at(0x399A);
// bitfield macros
#define _PIE10_CCP4IE_POSN                                  0x0
#define _PIE10_CCP4IE_POSITION                              0x0
#define _PIE10_CCP4IE_SIZE                                  0x1
#define _PIE10_CCP4IE_LENGTH                                0x1
#define _PIE10_CCP4IE_MASK                                  0x1
#define _PIE10_CLC4IE_POSN                                  0x1
#define _PIE10_CLC4IE_POSITION                              0x1
#define _PIE10_CLC4IE_SIZE                                  0x1
#define _PIE10_CLC4IE_LENGTH                                0x1
#define _PIE10_CLC4IE_MASK                                  0x2

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x39A0);
#ifndef _LIB_BUILD
asm("PIR0 equ 039A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned NVMIF                  :1;
        unsigned SCANIF                 :1;
        unsigned CRCIF                  :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x39A0);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_HLVDIF_POSN                                   0x1
#define _PIR0_HLVDIF_POSITION                               0x1
#define _PIR0_HLVDIF_SIZE                                   0x1
#define _PIR0_HLVDIF_LENGTH                                 0x1
#define _PIR0_HLVDIF_MASK                                   0x2
#define _PIR0_OSFIF_POSN                                    0x2
#define _PIR0_OSFIF_POSITION                                0x2
#define _PIR0_OSFIF_SIZE                                    0x1
#define _PIR0_OSFIF_LENGTH                                  0x1
#define _PIR0_OSFIF_MASK                                    0x4
#define _PIR0_CSWIF_POSN                                    0x3
#define _PIR0_CSWIF_POSITION                                0x3
#define _PIR0_CSWIF_SIZE                                    0x1
#define _PIR0_CSWIF_LENGTH                                  0x1
#define _PIR0_CSWIF_MASK                                    0x8
#define _PIR0_NVMIF_POSN                                    0x4
#define _PIR0_NVMIF_POSITION                                0x4
#define _PIR0_NVMIF_SIZE                                    0x1
#define _PIR0_NVMIF_LENGTH                                  0x1
#define _PIR0_NVMIF_MASK                                    0x10
#define _PIR0_SCANIF_POSN                                   0x5
#define _PIR0_SCANIF_POSITION                               0x5
#define _PIR0_SCANIF_SIZE                                   0x1
#define _PIR0_SCANIF_LENGTH                                 0x1
#define _PIR0_SCANIF_MASK                                   0x20
#define _PIR0_CRCIF_POSN                                    0x6
#define _PIR0_CRCIF_POSITION                                0x6
#define _PIR0_CRCIF_SIZE                                    0x1
#define _PIR0_CRCIF_LENGTH                                  0x1
#define _PIR0_CRCIF_MASK                                    0x40
#define _PIR0_IOCIF_POSN                                    0x7
#define _PIR0_IOCIF_POSITION                                0x7
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x39A1);
#ifndef _LIB_BUILD
asm("PIR1 equ 039A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ZCDIF                  :1;
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned C1IF                   :1;
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x39A1);
// bitfield macros
#define _PIR1_INT0IF_POSN                                   0x0
#define _PIR1_INT0IF_POSITION                               0x0
#define _PIR1_INT0IF_SIZE                                   0x1
#define _PIR1_INT0IF_LENGTH                                 0x1
#define _PIR1_INT0IF_MASK                                   0x1
#define _PIR1_ZCDIF_POSN                                    0x1
#define _PIR1_ZCDIF_POSITION                                0x1
#define _PIR1_ZCDIF_SIZE                                    0x1
#define _PIR1_ZCDIF_LENGTH                                  0x1
#define _PIR1_ZCDIF_MASK                                    0x2
#define _PIR1_ADIF_POSN                                     0x2
#define _PIR1_ADIF_POSITION                                 0x2
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x4
#define _PIR1_ADTIF_POSN                                    0x3
#define _PIR1_ADTIF_POSITION                                0x3
#define _PIR1_ADTIF_SIZE                                    0x1
#define _PIR1_ADTIF_LENGTH                                  0x1
#define _PIR1_ADTIF_MASK                                    0x8
#define _PIR1_C1IF_POSN                                     0x4
#define _PIR1_C1IF_POSITION                                 0x4
#define _PIR1_C1IF_SIZE                                     0x1
#define _PIR1_C1IF_LENGTH                                   0x1
#define _PIR1_C1IF_MASK                                     0x10
#define _PIR1_SMT1IF_POSN                                   0x5
#define _PIR1_SMT1IF_POSITION                               0x5
#define _PIR1_SMT1IF_SIZE                                   0x1
#define _PIR1_SMT1IF_LENGTH                                 0x1
#define _PIR1_SMT1IF_MASK                                   0x20
#define _PIR1_SMT1PRAIF_POSN                                0x6
#define _PIR1_SMT1PRAIF_POSITION                            0x6
#define _PIR1_SMT1PRAIF_SIZE                                0x1
#define _PIR1_SMT1PRAIF_LENGTH                              0x1
#define _PIR1_SMT1PRAIF_MASK                                0x40
#define _PIR1_SMT1PWAIF_POSN                                0x7
#define _PIR1_SMT1PWAIF_POSITION                            0x7
#define _PIR1_SMT1PWAIF_SIZE                                0x1
#define _PIR1_SMT1PWAIF_LENGTH                              0x1
#define _PIR1_SMT1PWAIF_MASK                                0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x39A2);
#ifndef _LIB_BUILD
asm("PIR2 equ 039A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned I2C1RXIF               :1;
    };
} PIR2bits_t;
