MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K42/mcu.h
// Register: DMA2DSAH
#define DMA2DSAH DMA2DSAH
extern volatile unsigned char           DMA2DSAH            __at(0x3BD1);
#ifndef _LIB_BUILD
asm("DMA2DSAH equ 03BD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA8                   :1;
        unsigned DSA9                   :1;
        unsigned DSA10                  :1;
        unsigned DSA11                  :1;
        unsigned DSA12                  :1;
        unsigned DSA13                  :1;
        unsigned DSA14                  :1;
        unsigned DSA15                  :1;
    };
    struct {
        unsigned DMA2DSA                :8;
    };
    struct {
        unsigned DMA2DSA8               :1;
        unsigned DMA2DSA9               :1;
        unsigned DMA2DSA10              :1;
        unsigned DMA2DSA11              :1;
        unsigned DMA2DSA12              :1;
        unsigned DMA2DSA13              :1;
        unsigned DMA2DSA14              :1;
        unsigned DMA2DSA15              :1;
    };
} DMA2DSAHbits_t;
extern volatile DMA2DSAHbits_t DMA2DSAHbits __at(0x3BD1);
// bitfield macros
#define _DMA2DSAH_DSA_POSN                                  0x0
#define _DMA2DSAH_DSA_POSITION                              0x0
#define _DMA2DSAH_DSA_SIZE                                  0x8
#define _DMA2DSAH_DSA_LENGTH                                0x8
#define _DMA2DSAH_DSA_MASK                                  0xFF
#define _DMA2DSAH_DSA8_POSN                                 0x0
#define _DMA2DSAH_DSA8_POSITION                             0x0
#define _DMA2DSAH_DSA8_SIZE                                 0x1
#define _DMA2DSAH_DSA8_LENGTH                               0x1
#define _DMA2DSAH_DSA8_MASK                                 0x1
#define _DMA2DSAH_DSA9_POSN                                 0x1
#define _DMA2DSAH_DSA9_POSITION                             0x1
#define _DMA2DSAH_DSA9_SIZE                                 0x1
#define _DMA2DSAH_DSA9_LENGTH                               0x1
#define _DMA2DSAH_DSA9_MASK                                 0x2
#define _DMA2DSAH_DSA10_POSN                                0x2
#define _DMA2DSAH_DSA10_POSITION                            0x2
#define _DMA2DSAH_DSA10_SIZE                                0x1
#define _DMA2DSAH_DSA10_LENGTH                              0x1
#define _DMA2DSAH_DSA10_MASK                                0x4
#define _DMA2DSAH_DSA11_POSN                                0x3
#define _DMA2DSAH_DSA11_POSITION                            0x3
#define _DMA2DSAH_DSA11_SIZE                                0x1
#define _DMA2DSAH_DSA11_LENGTH                              0x1
#define _DMA2DSAH_DSA11_MASK                                0x8
#define _DMA2DSAH_DSA12_POSN                                0x4
#define _DMA2DSAH_DSA12_POSITION                            0x4
#define _DMA2DSAH_DSA12_SIZE                                0x1
#define _DMA2DSAH_DSA12_LENGTH                              0x1
#define _DMA2DSAH_DSA12_MASK                                0x10
#define _DMA2DSAH_DSA13_POSN                                0x5
#define _DMA2DSAH_DSA13_POSITION                            0x5
#define _DMA2DSAH_DSA13_SIZE                                0x1
#define _DMA2DSAH_DSA13_LENGTH                              0x1
#define _DMA2DSAH_DSA13_MASK                                0x20
#define _DMA2DSAH_DSA14_POSN                                0x6
#define _DMA2DSAH_DSA14_POSITION                            0x6
#define _DMA2DSAH_DSA14_SIZE                                0x1
#define _DMA2DSAH_DSA14_LENGTH                              0x1
#define _DMA2DSAH_DSA14_MASK                                0x40
#define _DMA2DSAH_DSA15_POSN                                0x7
#define _DMA2DSAH_DSA15_POSITION                            0x7
#define _DMA2DSAH_DSA15_SIZE                                0x1
#define _DMA2DSAH_DSA15_LENGTH                              0x1
#define _DMA2DSAH_DSA15_MASK                                0x80
#define _DMA2DSAH_DMA2DSA_POSN                              0x0
#define _DMA2DSAH_DMA2DSA_POSITION                          0x0
#define _DMA2DSAH_DMA2DSA_SIZE                              0x8
#define _DMA2DSAH_DMA2DSA_LENGTH                            0x8
#define _DMA2DSAH_DMA2DSA_MASK                              0xFF
#define _DMA2DSAH_DMA2DSA8_POSN                             0x0
#define _DMA2DSAH_DMA2DSA8_POSITION                         0x0
#define _DMA2DSAH_DMA2DSA8_SIZE                             0x1
#define _DMA2DSAH_DMA2DSA8_LENGTH                           0x1
#define _DMA2DSAH_DMA2DSA8_MASK                             0x1
#define _DMA2DSAH_DMA2DSA9_POSN                             0x1
#define _DMA2DSAH_DMA2DSA9_POSITION                         0x1
#define _DMA2DSAH_DMA2DSA9_SIZE                             0x1
#define _DMA2DSAH_DMA2DSA9_LENGTH                           0x1
#define _DMA2DSAH_DMA2DSA9_MASK                             0x2
#define _DMA2DSAH_DMA2DSA10_POSN                            0x2
#define _DMA2DSAH_DMA2DSA10_POSITION                        0x2
#define _DMA2DSAH_DMA2DSA10_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA10_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA10_MASK                            0x4
#define _DMA2DSAH_DMA2DSA11_POSN                            0x3
#define _DMA2DSAH_DMA2DSA11_POSITION                        0x3
#define _DMA2DSAH_DMA2DSA11_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA11_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA11_MASK                            0x8
#define _DMA2DSAH_DMA2DSA12_POSN                            0x4
#define _DMA2DSAH_DMA2DSA12_POSITION                        0x4
#define _DMA2DSAH_DMA2DSA12_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA12_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA12_MASK                            0x10
#define _DMA2DSAH_DMA2DSA13_POSN                            0x5
#define _DMA2DSAH_DMA2DSA13_POSITION                        0x5
#define _DMA2DSAH_DMA2DSA13_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA13_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA13_MASK                            0x20
#define _DMA2DSAH_DMA2DSA14_POSN                            0x6
#define _DMA2DSAH_DMA2DSA14_POSITION                        0x6
#define _DMA2DSAH_DMA2DSA14_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA14_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA14_MASK                            0x40
#define _DMA2DSAH_DMA2DSA15_POSN                            0x7
#define _DMA2DSAH_DMA2DSA15_POSITION                        0x7
#define _DMA2DSAH_DMA2DSA15_SIZE                            0x1
#define _DMA2DSAH_DMA2DSA15_LENGTH                          0x1
#define _DMA2DSAH_DMA2DSA15_MASK                            0x80

// Register: DMA2SCNT
#define DMA2SCNT DMA2SCNT
extern volatile unsigned short          DMA2SCNT            __at(0x3BD2);
#ifndef _LIB_BUILD
asm("DMA2SCNT equ 03BD2h");
#endif

// Register: DMA2SCNTL
#define DMA2SCNTL DMA2SCNTL
extern volatile unsigned char           DMA2SCNTL           __at(0x3BD2);
#ifndef _LIB_BUILD
asm("DMA2SCNTL equ 03BD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
    struct {
        unsigned DMA2SCNT               :8;
    };
    struct {
        unsigned DMA2SCNT0              :1;
        unsigned DMA2SCNT1              :1;
        unsigned DMA2SCNT2              :1;
        unsigned DMA2SCNT3              :1;
        unsigned DMA2SCNT4              :1;
        unsigned DMA2SCNT5              :1;
        unsigned DMA2SCNT6              :1;
        unsigned DMA2SCNT7              :1;
    };
} DMA2SCNTLbits_t;
extern volatile DMA2SCNTLbits_t DMA2SCNTLbits __at(0x3BD2);
// bitfield macros
#define _DMA2SCNTL_SCNT_POSN                                0x0
#define _DMA2SCNTL_SCNT_POSITION                            0x0
#define _DMA2SCNTL_SCNT_SIZE                                0x8
#define _DMA2SCNTL_SCNT_LENGTH                              0x8
#define _DMA2SCNTL_SCNT_MASK                                0xFF
#define _DMA2SCNTL_SCNT0_POSN                               0x0
#define _DMA2SCNTL_SCNT0_POSITION                           0x0
#define _DMA2SCNTL_SCNT0_SIZE                               0x1
#define _DMA2SCNTL_SCNT0_LENGTH                             0x1
#define _DMA2SCNTL_SCNT0_MASK                               0x1
#define _DMA2SCNTL_SCNT1_POSN                               0x1
#define _DMA2SCNTL_SCNT1_POSITION                           0x1
#define _DMA2SCNTL_SCNT1_SIZE                               0x1
#define _DMA2SCNTL_SCNT1_LENGTH                             0x1
#define _DMA2SCNTL_SCNT1_MASK                               0x2
#define _DMA2SCNTL_SCNT2_POSN                               0x2
#define _DMA2SCNTL_SCNT2_POSITION                           0x2
#define _DMA2SCNTL_SCNT2_SIZE                               0x1
#define _DMA2SCNTL_SCNT2_LENGTH                             0x1
#define _DMA2SCNTL_SCNT2_MASK                               0x4
#define _DMA2SCNTL_SCNT3_POSN                               0x3
#define _DMA2SCNTL_SCNT3_POSITION                           0x3
#define _DMA2SCNTL_SCNT3_SIZE                               0x1
#define _DMA2SCNTL_SCNT3_LENGTH                             0x1
#define _DMA2SCNTL_SCNT3_MASK                               0x8
#define _DMA2SCNTL_SCNT4_POSN                               0x4
#define _DMA2SCNTL_SCNT4_POSITION                           0x4
#define _DMA2SCNTL_SCNT4_SIZE                               0x1
#define _DMA2SCNTL_SCNT4_LENGTH                             0x1
#define _DMA2SCNTL_SCNT4_MASK                               0x10
#define _DMA2SCNTL_SCNT5_POSN                               0x5
#define _DMA2SCNTL_SCNT5_POSITION                           0x5
#define _DMA2SCNTL_SCNT5_SIZE                               0x1
#define _DMA2SCNTL_SCNT5_LENGTH                             0x1
#define _DMA2SCNTL_SCNT5_MASK                               0x20
#define _DMA2SCNTL_SCNT6_POSN                               0x6
#define _DMA2SCNTL_SCNT6_POSITION                           0x6
#define _DMA2SCNTL_SCNT6_SIZE                               0x1
#define _DMA2SCNTL_SCNT6_LENGTH                             0x1
#define _DMA2SCNTL_SCNT6_MASK                               0x40
#define _DMA2SCNTL_SCNT7_POSN                               0x7
#define _DMA2SCNTL_SCNT7_POSITION                           0x7
#define _DMA2SCNTL_SCNT7_SIZE                               0x1
#define _DMA2SCNTL_SCNT7_LENGTH                             0x1
#define _DMA2SCNTL_SCNT7_MASK                               0x80
#define _DMA2SCNTL_DMA2SCNT_POSN                            0x0
#define _DMA2SCNTL_DMA2SCNT_POSITION                        0x0
#define _DMA2SCNTL_DMA2SCNT_SIZE                            0x8
#define _DMA2SCNTL_DMA2SCNT_LENGTH                          0x8
#define _DMA2SCNTL_DMA2SCNT_MASK                            0xFF
#define _DMA2SCNTL_DMA2SCNT0_POSN                           0x0
#define _DMA2SCNTL_DMA2SCNT0_POSITION                       0x0
#define _DMA2SCNTL_DMA2SCNT0_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT0_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT0_MASK                           0x1
#define _DMA2SCNTL_DMA2SCNT1_POSN                           0x1
#define _DMA2SCNTL_DMA2SCNT1_POSITION                       0x1
#define _DMA2SCNTL_DMA2SCNT1_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT1_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT1_MASK                           0x2
#define _DMA2SCNTL_DMA2SCNT2_POSN                           0x2
#define _DMA2SCNTL_DMA2SCNT2_POSITION                       0x2
#define _DMA2SCNTL_DMA2SCNT2_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT2_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT2_MASK                           0x4
#define _DMA2SCNTL_DMA2SCNT3_POSN                           0x3
#define _DMA2SCNTL_DMA2SCNT3_POSITION                       0x3
#define _DMA2SCNTL_DMA2SCNT3_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT3_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT3_MASK                           0x8
#define _DMA2SCNTL_DMA2SCNT4_POSN                           0x4
#define _DMA2SCNTL_DMA2SCNT4_POSITION                       0x4
#define _DMA2SCNTL_DMA2SCNT4_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT4_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT4_MASK                           0x10
#define _DMA2SCNTL_DMA2SCNT5_POSN                           0x5
#define _DMA2SCNTL_DMA2SCNT5_POSITION                       0x5
#define _DMA2SCNTL_DMA2SCNT5_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT5_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT5_MASK                           0x20
#define _DMA2SCNTL_DMA2SCNT6_POSN                           0x6
#define _DMA2SCNTL_DMA2SCNT6_POSITION                       0x6
#define _DMA2SCNTL_DMA2SCNT6_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT6_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT6_MASK                           0x40
#define _DMA2SCNTL_DMA2SCNT7_POSN                           0x7
#define _DMA2SCNTL_DMA2SCNT7_POSITION                       0x7
#define _DMA2SCNTL_DMA2SCNT7_SIZE                           0x1
#define _DMA2SCNTL_DMA2SCNT7_LENGTH                         0x1
#define _DMA2SCNTL_DMA2SCNT7_MASK                           0x80

// Register: DMA2SCNTH
#define DMA2SCNTH DMA2SCNTH
extern volatile unsigned char           DMA2SCNTH           __at(0x3BD3);
#ifndef _LIB_BUILD
asm("DMA2SCNTH equ 03BD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :4;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
    struct {
        unsigned DMA2SCNT               :4;
    };
    struct {
        unsigned DMA2SCNT8              :1;
        unsigned DMA2SCNT9              :1;
        unsigned DMA2SCNT10             :1;
        unsigned DMA2SCNT11             :1;
    };
} DMA2SCNTHbits_t;
