MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K42/mcu.h
extern volatile DMA1SPTRUbits_t DMA1SPTRUbits __at(0x3BF6);
// bitfield macros
#define _DMA1SPTRU_SPTR_POSN                                0x0
#define _DMA1SPTRU_SPTR_POSITION                            0x0
#define _DMA1SPTRU_SPTR_SIZE                                0x6
#define _DMA1SPTRU_SPTR_LENGTH                              0x6
#define _DMA1SPTRU_SPTR_MASK                                0x3F
#define _DMA1SPTRU_SPTR16_POSN                              0x0
#define _DMA1SPTRU_SPTR16_POSITION                          0x0
#define _DMA1SPTRU_SPTR16_SIZE                              0x1
#define _DMA1SPTRU_SPTR16_LENGTH                            0x1
#define _DMA1SPTRU_SPTR16_MASK                              0x1
#define _DMA1SPTRU_SPTR17_POSN                              0x1
#define _DMA1SPTRU_SPTR17_POSITION                          0x1
#define _DMA1SPTRU_SPTR17_SIZE                              0x1
#define _DMA1SPTRU_SPTR17_LENGTH                            0x1
#define _DMA1SPTRU_SPTR17_MASK                              0x2
#define _DMA1SPTRU_SPTR18_POSN                              0x2
#define _DMA1SPTRU_SPTR18_POSITION                          0x2
#define _DMA1SPTRU_SPTR18_SIZE                              0x1
#define _DMA1SPTRU_SPTR18_LENGTH                            0x1
#define _DMA1SPTRU_SPTR18_MASK                              0x4
#define _DMA1SPTRU_SPTR19_POSN                              0x3
#define _DMA1SPTRU_SPTR19_POSITION                          0x3
#define _DMA1SPTRU_SPTR19_SIZE                              0x1
#define _DMA1SPTRU_SPTR19_LENGTH                            0x1
#define _DMA1SPTRU_SPTR19_MASK                              0x8
#define _DMA1SPTRU_SPTR20_POSN                              0x4
#define _DMA1SPTRU_SPTR20_POSITION                          0x4
#define _DMA1SPTRU_SPTR20_SIZE                              0x1
#define _DMA1SPTRU_SPTR20_LENGTH                            0x1
#define _DMA1SPTRU_SPTR20_MASK                              0x10
#define _DMA1SPTRU_SPTR21_POSN                              0x5
#define _DMA1SPTRU_SPTR21_POSITION                          0x5
#define _DMA1SPTRU_SPTR21_SIZE                              0x1
#define _DMA1SPTRU_SPTR21_LENGTH                            0x1
#define _DMA1SPTRU_SPTR21_MASK                              0x20
#define _DMA1SPTRU_DMA1SPTR_POSN                            0x0
#define _DMA1SPTRU_DMA1SPTR_POSITION                        0x0
#define _DMA1SPTRU_DMA1SPTR_SIZE                            0x6
#define _DMA1SPTRU_DMA1SPTR_LENGTH                          0x6
#define _DMA1SPTRU_DMA1SPTR_MASK                            0x3F
#define _DMA1SPTRU_DMA1SPTR16_POSN                          0x0
#define _DMA1SPTRU_DMA1SPTR16_POSITION                      0x0
#define _DMA1SPTRU_DMA1SPTR16_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR16_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR16_MASK                          0x1
#define _DMA1SPTRU_DMA1SPTR17_POSN                          0x1
#define _DMA1SPTRU_DMA1SPTR17_POSITION                      0x1
#define _DMA1SPTRU_DMA1SPTR17_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR17_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR17_MASK                          0x2
#define _DMA1SPTRU_DMA1SPTR18_POSN                          0x2
#define _DMA1SPTRU_DMA1SPTR18_POSITION                      0x2
#define _DMA1SPTRU_DMA1SPTR18_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR18_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR18_MASK                          0x4
#define _DMA1SPTRU_DMA1SPTR19_POSN                          0x3
#define _DMA1SPTRU_DMA1SPTR19_POSITION                      0x3
#define _DMA1SPTRU_DMA1SPTR19_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR19_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR19_MASK                          0x8
#define _DMA1SPTRU_DMA1SPTR20_POSN                          0x4
#define _DMA1SPTRU_DMA1SPTR20_POSITION                      0x4
#define _DMA1SPTRU_DMA1SPTR20_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR20_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR20_MASK                          0x10
#define _DMA1SPTRU_DMA1SPTR21_POSN                          0x5
#define _DMA1SPTRU_DMA1SPTR21_POSITION                      0x5
#define _DMA1SPTRU_DMA1SPTR21_SIZE                          0x1
#define _DMA1SPTRU_DMA1SPTR21_LENGTH                        0x1
#define _DMA1SPTRU_DMA1SPTR21_MASK                          0x20

// Register: DMA1SSZ
#define DMA1SSZ DMA1SSZ
extern volatile unsigned short          DMA1SSZ             __at(0x3BF7);
#ifndef _LIB_BUILD
asm("DMA1SSZ equ 03BF7h");
#endif

// Register: DMA1SSZL
#define DMA1SSZL DMA1SSZL
extern volatile unsigned char           DMA1SSZL            __at(0x3BF7);
#ifndef _LIB_BUILD
asm("DMA1SSZL equ 03BF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned DMA1SSZ                :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
    struct {
        unsigned DMA1SSZ0               :1;
        unsigned DMA1SSZ1               :1;
        unsigned DMA1SSZ2               :1;
        unsigned DMA1SSZ3               :1;
        unsigned DMA1SSZ4               :1;
        unsigned DMA1SSZ5               :1;
        unsigned DMA1SSZ6               :1;
        unsigned DMA1SSZ7               :1;
    };
} DMA1SSZLbits_t;
extern volatile DMA1SSZLbits_t DMA1SSZLbits __at(0x3BF7);
// bitfield macros
#define _DMA1SSZL_SSZ_POSN                                  0x0
#define _DMA1SSZL_SSZ_POSITION                              0x0
#define _DMA1SSZL_SSZ_SIZE                                  0x8
#define _DMA1SSZL_SSZ_LENGTH                                0x8
#define _DMA1SSZL_SSZ_MASK                                  0xFF
#define _DMA1SSZL_DMA1SSZ_POSN                              0x0
#define _DMA1SSZL_DMA1SSZ_POSITION                          0x0
#define _DMA1SSZL_DMA1SSZ_SIZE                              0x8
#define _DMA1SSZL_DMA1SSZ_LENGTH                            0x8
#define _DMA1SSZL_DMA1SSZ_MASK                              0xFF
#define _DMA1SSZL_SSZ0_POSN                                 0x0
#define _DMA1SSZL_SSZ0_POSITION                             0x0
#define _DMA1SSZL_SSZ0_SIZE                                 0x1
#define _DMA1SSZL_SSZ0_LENGTH                               0x1
#define _DMA1SSZL_SSZ0_MASK                                 0x1
#define _DMA1SSZL_SSZ1_POSN                                 0x1
#define _DMA1SSZL_SSZ1_POSITION                             0x1
#define _DMA1SSZL_SSZ1_SIZE                                 0x1
#define _DMA1SSZL_SSZ1_LENGTH                               0x1
#define _DMA1SSZL_SSZ1_MASK                                 0x2
#define _DMA1SSZL_SSZ2_POSN                                 0x2
#define _DMA1SSZL_SSZ2_POSITION                             0x2
#define _DMA1SSZL_SSZ2_SIZE                                 0x1
#define _DMA1SSZL_SSZ2_LENGTH                               0x1
#define _DMA1SSZL_SSZ2_MASK                                 0x4
#define _DMA1SSZL_SSZ3_POSN                                 0x3
#define _DMA1SSZL_SSZ3_POSITION                             0x3
#define _DMA1SSZL_SSZ3_SIZE                                 0x1
#define _DMA1SSZL_SSZ3_LENGTH                               0x1
#define _DMA1SSZL_SSZ3_MASK                                 0x8
#define _DMA1SSZL_SSZ4_POSN                                 0x4
#define _DMA1SSZL_SSZ4_POSITION                             0x4
#define _DMA1SSZL_SSZ4_SIZE                                 0x1
#define _DMA1SSZL_SSZ4_LENGTH                               0x1
#define _DMA1SSZL_SSZ4_MASK                                 0x10
#define _DMA1SSZL_SSZ5_POSN                                 0x5
#define _DMA1SSZL_SSZ5_POSITION                             0x5
#define _DMA1SSZL_SSZ5_SIZE                                 0x1
#define _DMA1SSZL_SSZ5_LENGTH                               0x1
#define _DMA1SSZL_SSZ5_MASK                                 0x20
#define _DMA1SSZL_SSZ6_POSN                                 0x6
#define _DMA1SSZL_SSZ6_POSITION                             0x6
#define _DMA1SSZL_SSZ6_SIZE                                 0x1
#define _DMA1SSZL_SSZ6_LENGTH                               0x1
#define _DMA1SSZL_SSZ6_MASK                                 0x40
#define _DMA1SSZL_SSZ7_POSN                                 0x7
#define _DMA1SSZL_SSZ7_POSITION                             0x7
#define _DMA1SSZL_SSZ7_SIZE                                 0x1
#define _DMA1SSZL_SSZ7_LENGTH                               0x1
#define _DMA1SSZL_SSZ7_MASK                                 0x80
#define _DMA1SSZL_DMA1SSZ0_POSN                             0x0
#define _DMA1SSZL_DMA1SSZ0_POSITION                         0x0
#define _DMA1SSZL_DMA1SSZ0_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ0_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ0_MASK                             0x1
#define _DMA1SSZL_DMA1SSZ1_POSN                             0x1
#define _DMA1SSZL_DMA1SSZ1_POSITION                         0x1
#define _DMA1SSZL_DMA1SSZ1_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ1_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ1_MASK                             0x2
#define _DMA1SSZL_DMA1SSZ2_POSN                             0x2
#define _DMA1SSZL_DMA1SSZ2_POSITION                         0x2
#define _DMA1SSZL_DMA1SSZ2_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ2_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ2_MASK                             0x4
#define _DMA1SSZL_DMA1SSZ3_POSN                             0x3
#define _DMA1SSZL_DMA1SSZ3_POSITION                         0x3
#define _DMA1SSZL_DMA1SSZ3_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ3_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ3_MASK                             0x8
#define _DMA1SSZL_DMA1SSZ4_POSN                             0x4
#define _DMA1SSZL_DMA1SSZ4_POSITION                         0x4
#define _DMA1SSZL_DMA1SSZ4_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ4_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ4_MASK                             0x10
#define _DMA1SSZL_DMA1SSZ5_POSN                             0x5
#define _DMA1SSZL_DMA1SSZ5_POSITION                         0x5
#define _DMA1SSZL_DMA1SSZ5_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ5_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ5_MASK                             0x20
#define _DMA1SSZL_DMA1SSZ6_POSN                             0x6
#define _DMA1SSZL_DMA1SSZ6_POSITION                         0x6
#define _DMA1SSZL_DMA1SSZ6_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ6_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ6_MASK                             0x40
#define _DMA1SSZL_DMA1SSZ7_POSN                             0x7
#define _DMA1SSZL_DMA1SSZ7_POSITION                         0x7
#define _DMA1SSZL_DMA1SSZ7_SIZE                             0x1
#define _DMA1SSZL_DMA1SSZ7_LENGTH                           0x1
#define _DMA1SSZL_DMA1SSZ7_MASK                             0x80

