MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K42/mcu.h
extern volatile CWG3STRbits_t CWG3STRbits __at(0x3F48);
// bitfield macros
#define _CWG3STR_STRA_POSN                                  0x0
#define _CWG3STR_STRA_POSITION                              0x0
#define _CWG3STR_STRA_SIZE                                  0x1
#define _CWG3STR_STRA_LENGTH                                0x1
#define _CWG3STR_STRA_MASK                                  0x1
#define _CWG3STR_STRB_POSN                                  0x1
#define _CWG3STR_STRB_POSITION                              0x1
#define _CWG3STR_STRB_SIZE                                  0x1
#define _CWG3STR_STRB_LENGTH                                0x1
#define _CWG3STR_STRB_MASK                                  0x2
#define _CWG3STR_STRC_POSN                                  0x2
#define _CWG3STR_STRC_POSITION                              0x2
#define _CWG3STR_STRC_SIZE                                  0x1
#define _CWG3STR_STRC_LENGTH                                0x1
#define _CWG3STR_STRC_MASK                                  0x4
#define _CWG3STR_STRD_POSN                                  0x3
#define _CWG3STR_STRD_POSITION                              0x3
#define _CWG3STR_STRD_SIZE                                  0x1
#define _CWG3STR_STRD_LENGTH                                0x1
#define _CWG3STR_STRD_MASK                                  0x8
#define _CWG3STR_OVRA_POSN                                  0x4
#define _CWG3STR_OVRA_POSITION                              0x4
#define _CWG3STR_OVRA_SIZE                                  0x1
#define _CWG3STR_OVRA_LENGTH                                0x1
#define _CWG3STR_OVRA_MASK                                  0x10
#define _CWG3STR_OVRB_POSN                                  0x5
#define _CWG3STR_OVRB_POSITION                              0x5
#define _CWG3STR_OVRB_SIZE                                  0x1
#define _CWG3STR_OVRB_LENGTH                                0x1
#define _CWG3STR_OVRB_MASK                                  0x20
#define _CWG3STR_OVRC_POSN                                  0x6
#define _CWG3STR_OVRC_POSITION                              0x6
#define _CWG3STR_OVRC_SIZE                                  0x1
#define _CWG3STR_OVRC_LENGTH                                0x1
#define _CWG3STR_OVRC_MASK                                  0x40
#define _CWG3STR_OVRD_POSN                                  0x7
#define _CWG3STR_OVRD_POSITION                              0x7
#define _CWG3STR_OVRD_SIZE                                  0x1
#define _CWG3STR_OVRD_LENGTH                                0x1
#define _CWG3STR_OVRD_MASK                                  0x80
#define _CWG3STR_CWG3STRA_POSN                              0x0
#define _CWG3STR_CWG3STRA_POSITION                          0x0
#define _CWG3STR_CWG3STRA_SIZE                              0x1
#define _CWG3STR_CWG3STRA_LENGTH                            0x1
#define _CWG3STR_CWG3STRA_MASK                              0x1
#define _CWG3STR_CWG3STRB_POSN                              0x1
#define _CWG3STR_CWG3STRB_POSITION                          0x1
#define _CWG3STR_CWG3STRB_SIZE                              0x1
#define _CWG3STR_CWG3STRB_LENGTH                            0x1
#define _CWG3STR_CWG3STRB_MASK                              0x2
#define _CWG3STR_CWG3STRC_POSN                              0x2
#define _CWG3STR_CWG3STRC_POSITION                          0x2
#define _CWG3STR_CWG3STRC_SIZE                              0x1
#define _CWG3STR_CWG3STRC_LENGTH                            0x1
#define _CWG3STR_CWG3STRC_MASK                              0x4
#define _CWG3STR_CWG3STRD_POSN                              0x3
#define _CWG3STR_CWG3STRD_POSITION                          0x3
#define _CWG3STR_CWG3STRD_SIZE                              0x1
#define _CWG3STR_CWG3STRD_LENGTH                            0x1
#define _CWG3STR_CWG3STRD_MASK                              0x8
#define _CWG3STR_CWG3OVRA_POSN                              0x4
#define _CWG3STR_CWG3OVRA_POSITION                          0x4
#define _CWG3STR_CWG3OVRA_SIZE                              0x1
#define _CWG3STR_CWG3OVRA_LENGTH                            0x1
#define _CWG3STR_CWG3OVRA_MASK                              0x10
#define _CWG3STR_CWG3OVRB_POSN                              0x5
#define _CWG3STR_CWG3OVRB_POSITION                          0x5
#define _CWG3STR_CWG3OVRB_SIZE                              0x1
#define _CWG3STR_CWG3OVRB_LENGTH                            0x1
#define _CWG3STR_CWG3OVRB_MASK                              0x20
#define _CWG3STR_CWG3OVRC_POSN                              0x6
#define _CWG3STR_CWG3OVRC_POSITION                          0x6
#define _CWG3STR_CWG3OVRC_SIZE                              0x1
#define _CWG3STR_CWG3OVRC_LENGTH                            0x1
#define _CWG3STR_CWG3OVRC_MASK                              0x40
#define _CWG3STR_CWG3OVRD_POSN                              0x7
#define _CWG3STR_CWG3OVRD_POSITION                          0x7
#define _CWG3STR_CWG3OVRD_SIZE                              0x1
#define _CWG3STR_CWG3OVRD_LENGTH                            0x1
#define _CWG3STR_CWG3OVRD_MASK                              0x80

// Register: CWG2CLK
#define CWG2CLK CWG2CLK
extern volatile unsigned char           CWG2CLK             __at(0x3F49);
#ifndef _LIB_BUILD
asm("CWG2CLK equ 03F49h");
#endif
// aliases
extern volatile unsigned char           CWG2CLKCON          __at(0x3F49);
#ifndef _LIB_BUILD
asm("CWG2CLKCON equ 03F49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG2CS                 :1;
    };
} CWG2CLKbits_t;
extern volatile CWG2CLKbits_t CWG2CLKbits __at(0x3F49);
// bitfield macros
#define _CWG2CLK_CS_POSN                                    0x0
#define _CWG2CLK_CS_POSITION                                0x0
#define _CWG2CLK_CS_SIZE                                    0x1
#define _CWG2CLK_CS_LENGTH                                  0x1
#define _CWG2CLK_CS_MASK                                    0x1
#define _CWG2CLK_CWG2CS_POSN                                0x0
#define _CWG2CLK_CWG2CS_POSITION                            0x0
#define _CWG2CLK_CWG2CS_SIZE                                0x1
#define _CWG2CLK_CWG2CS_LENGTH                              0x1
#define _CWG2CLK_CWG2CS_MASK                                0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG2CS                 :1;
    };
} CWG2CLKCONbits_t;
extern volatile CWG2CLKCONbits_t CWG2CLKCONbits __at(0x3F49);
// bitfield macros
#define _CWG2CLKCON_CS_POSN                                 0x0
#define _CWG2CLKCON_CS_POSITION                             0x0
#define _CWG2CLKCON_CS_SIZE                                 0x1
#define _CWG2CLKCON_CS_LENGTH                               0x1
#define _CWG2CLKCON_CS_MASK                                 0x1
#define _CWG2CLKCON_CWG2CS_POSN                             0x0
#define _CWG2CLKCON_CWG2CS_POSITION                         0x0
#define _CWG2CLKCON_CWG2CS_SIZE                             0x1
#define _CWG2CLKCON_CWG2CS_LENGTH                           0x1
#define _CWG2CLKCON_CWG2CS_MASK                             0x1

// Register: CWG2ISM
#define CWG2ISM CWG2ISM
extern volatile unsigned char           CWG2ISM             __at(0x3F4A);
#ifndef _LIB_BUILD
asm("CWG2ISM equ 03F4Ah");
#endif
// aliases
extern volatile unsigned char           CWG2DAT             __at(0x3F4A);
#ifndef _LIB_BUILD
asm("CWG2DAT equ 03F4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG2ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG2ISMbits_t;
extern volatile CWG2ISMbits_t CWG2ISMbits __at(0x3F4A);
// bitfield macros
#define _CWG2ISM_ISM_POSN                                   0x0
#define _CWG2ISM_ISM_POSITION                               0x0
#define _CWG2ISM_ISM_SIZE                                   0x8
#define _CWG2ISM_ISM_LENGTH                                 0x8
#define _CWG2ISM_ISM_MASK                                   0xFF
#define _CWG2ISM_CWG2ISM_POSN                               0x0
#define _CWG2ISM_CWG2ISM_POSITION                           0x0
#define _CWG2ISM_CWG2ISM_SIZE                               0x8
#define _CWG2ISM_CWG2ISM_LENGTH                             0x8
#define _CWG2ISM_CWG2ISM_MASK                               0xFF
#define _CWG2ISM_ISM0_POSN                                  0x0
#define _CWG2ISM_ISM0_POSITION                              0x0
#define _CWG2ISM_ISM0_SIZE                                  0x1
#define _CWG2ISM_ISM0_LENGTH                                0x1
#define _CWG2ISM_ISM0_MASK                                  0x1
#define _CWG2ISM_ISM1_POSN                                  0x1
#define _CWG2ISM_ISM1_POSITION                              0x1
#define _CWG2ISM_ISM1_SIZE                                  0x1
#define _CWG2ISM_ISM1_LENGTH                                0x1
#define _CWG2ISM_ISM1_MASK                                  0x2
#define _CWG2ISM_ISM2_POSN                                  0x2
#define _CWG2ISM_ISM2_POSITION                              0x2
#define _CWG2ISM_ISM2_SIZE                                  0x1
#define _CWG2ISM_ISM2_LENGTH                                0x1
#define _CWG2ISM_ISM2_MASK                                  0x4
#define _CWG2ISM_ISM3_POSN                                  0x3
#define _CWG2ISM_ISM3_POSITION                              0x3
#define _CWG2ISM_ISM3_SIZE                                  0x1
#define _CWG2ISM_ISM3_LENGTH                                0x1
#define _CWG2ISM_ISM3_MASK                                  0x8
#define _CWG2ISM_ISM4_POSN                                  0x4
#define _CWG2ISM_ISM4_POSITION                              0x4
#define _CWG2ISM_ISM4_SIZE                                  0x1
#define _CWG2ISM_ISM4_LENGTH                                0x1
#define _CWG2ISM_ISM4_MASK                                  0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG2ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG2DATbits_t;
extern volatile CWG2DATbits_t CWG2DATbits __at(0x3F4A);
// bitfield macros
#define _CWG2DAT_ISM_POSN                                   0x0
#define _CWG2DAT_ISM_POSITION                               0x0
#define _CWG2DAT_ISM_SIZE                                   0x8
#define _CWG2DAT_ISM_LENGTH                                 0x8
#define _CWG2DAT_ISM_MASK                                   0xFF
#define _CWG2DAT_CWG2ISM_POSN                               0x0
#define _CWG2DAT_CWG2ISM_POSITION                           0x0
#define _CWG2DAT_CWG2ISM_SIZE                               0x8
#define _CWG2DAT_CWG2ISM_LENGTH                             0x8
#define _CWG2DAT_CWG2ISM_MASK                               0xFF
#define _CWG2DAT_ISM0_POSN                                  0x0
#define _CWG2DAT_ISM0_POSITION                              0x0
#define _CWG2DAT_ISM0_SIZE                                  0x1
#define _CWG2DAT_ISM0_LENGTH                                0x1
#define _CWG2DAT_ISM0_MASK                                  0x1
#define _CWG2DAT_ISM1_POSN                                  0x1
#define _CWG2DAT_ISM1_POSITION                              0x1
#define _CWG2DAT_ISM1_SIZE                                  0x1
#define _CWG2DAT_ISM1_LENGTH                                0x1
#define _CWG2DAT_ISM1_MASK                                  0x2
#define _CWG2DAT_ISM2_POSN                                  0x2
#define _CWG2DAT_ISM2_POSITION                              0x2
#define _CWG2DAT_ISM2_SIZE                                  0x1
#define _CWG2DAT_ISM2_LENGTH                                0x1
#define _CWG2DAT_ISM2_MASK                                  0x4
#define _CWG2DAT_ISM3_POSN                                  0x3
#define _CWG2DAT_ISM3_POSITION                              0x3
#define _CWG2DAT_ISM3_SIZE                                  0x1
#define _CWG2DAT_ISM3_LENGTH                                0x1
#define _CWG2DAT_ISM3_MASK                                  0x8
#define _CWG2DAT_ISM4_POSN                                  0x4
#define _CWG2DAT_ISM4_POSITION                              0x4
#define _CWG2DAT_ISM4_SIZE                                  0x1
#define _CWG2DAT_ISM4_LENGTH                                0x1
#define _CWG2DAT_ISM4_MASK                                  0x10

// Register: CWG2DBR
#define CWG2DBR CWG2DBR
extern volatile unsigned char           CWG2DBR             __at(0x3F4B);
#ifndef _LIB_BUILD
asm("CWG2DBR equ 03F4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :8;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG2DBR                :8;
    };
    struct {
        unsigned CWG2DBR0               :1;
        unsigned CWG2DBR1               :1;
        unsigned CWG2DBR2               :1;
        unsigned CWG2DBR3               :1;
        unsigned CWG2DBR4               :1;
        unsigned CWG2DBR5               :1;
    };
} CWG2DBRbits_t;
extern volatile CWG2DBRbits_t CWG2DBRbits __at(0x3F4B);
// bitfield macros
#define _CWG2DBR_DBR_POSN                                   0x0
#define _CWG2DBR_DBR_POSITION                               0x0
#define _CWG2DBR_DBR_SIZE                                   0x8
#define _CWG2DBR_DBR_LENGTH                                 0x8
#define _CWG2DBR_DBR_MASK                                   0xFF
#define _CWG2DBR_DBR0_POSN                                  0x0
#define _CWG2DBR_DBR0_POSITION                              0x0
#define _CWG2DBR_DBR0_SIZE                                  0x1
#define _CWG2DBR_DBR0_LENGTH                                0x1
#define _CWG2DBR_DBR0_MASK                                  0x1
#define _CWG2DBR_DBR1_POSN                                  0x1
#define _CWG2DBR_DBR1_POSITION                              0x1
#define _CWG2DBR_DBR1_SIZE                                  0x1
#define _CWG2DBR_DBR1_LENGTH                                0x1
#define _CWG2DBR_DBR1_MASK                                  0x2
#define _CWG2DBR_DBR2_POSN                                  0x2
#define _CWG2DBR_DBR2_POSITION                              0x2
#define _CWG2DBR_DBR2_SIZE                                  0x1
#define _CWG2DBR_DBR2_LENGTH                                0x1
#define _CWG2DBR_DBR2_MASK                                  0x4
#define _CWG2DBR_DBR3_POSN                                  0x3
#define _CWG2DBR_DBR3_POSITION                              0x3
#define _CWG2DBR_DBR3_SIZE                                  0x1
#define _CWG2DBR_DBR3_LENGTH                                0x1
#define _CWG2DBR_DBR3_MASK                                  0x8
#define _CWG2DBR_DBR4_POSN                                  0x4
#define _CWG2DBR_DBR4_POSITION                              0x4
#define _CWG2DBR_DBR4_SIZE                                  0x1
#define _CWG2DBR_DBR4_LENGTH                                0x1
#define _CWG2DBR_DBR4_MASK                                  0x10
#define _CWG2DBR_DBR5_POSN                                  0x5
#define _CWG2DBR_DBR5_POSITION                              0x5
#define _CWG2DBR_DBR5_SIZE                                  0x1
#define _CWG2DBR_DBR5_LENGTH                                0x1
#define _CWG2DBR_DBR5_MASK                                  0x20
#define _CWG2DBR_CWG2DBR_POSN                               0x0
#define _CWG2DBR_CWG2DBR_POSITION                           0x0
#define _CWG2DBR_CWG2DBR_SIZE                               0x8
#define _CWG2DBR_CWG2DBR_LENGTH                             0x8
#define _CWG2DBR_CWG2DBR_MASK                               0xFF
#define _CWG2DBR_CWG2DBR0_POSN                              0x0
#define _CWG2DBR_CWG2DBR0_POSITION                          0x0
#define _CWG2DBR_CWG2DBR0_SIZE                              0x1
#define _CWG2DBR_CWG2DBR0_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR0_MASK                              0x1
#define _CWG2DBR_CWG2DBR1_POSN                              0x1
#define _CWG2DBR_CWG2DBR1_POSITION                          0x1
#define _CWG2DBR_CWG2DBR1_SIZE                              0x1
#define _CWG2DBR_CWG2DBR1_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR1_MASK                              0x2
#define _CWG2DBR_CWG2DBR2_POSN                              0x2
#define _CWG2DBR_CWG2DBR2_POSITION                          0x2
#define _CWG2DBR_CWG2DBR2_SIZE                              0x1
#define _CWG2DBR_CWG2DBR2_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR2_MASK                              0x4
#define _CWG2DBR_CWG2DBR3_POSN                              0x3
#define _CWG2DBR_CWG2DBR3_POSITION                          0x3
#define _CWG2DBR_CWG2DBR3_SIZE                              0x1
#define _CWG2DBR_CWG2DBR3_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR3_MASK                              0x8
#define _CWG2DBR_CWG2DBR4_POSN                              0x4
#define _CWG2DBR_CWG2DBR4_POSITION                          0x4
#define _CWG2DBR_CWG2DBR4_SIZE                              0x1
#define _CWG2DBR_CWG2DBR4_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR4_MASK                              0x10
#define _CWG2DBR_CWG2DBR5_POSN                              0x5
#define _CWG2DBR_CWG2DBR5_POSITION                          0x5
#define _CWG2DBR_CWG2DBR5_SIZE                              0x1
#define _CWG2DBR_CWG2DBR5_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR5_MASK                              0x20

